tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "wagoodman/dive"

######################################
# FONTS

cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
cask "font-menlo-for-powerline"

######################################
# UTILS

cask "1password"
# cask "alfred"
cask "bettertouchtool"
cask "calibre"
cask "carbon-copy-cloner"
cask "cleanmymac"
cask "cloudapp"
cask "dropbox"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "gpg-suite"
cask "java"
cask "kap"
cask "karabiner-elements"
cask "keybase"
cask "mullvadvpn"
cask "qbittorent"
cask "skype"
cask "slack"
cask "spotify"
cask "steam"
cask "vlc"

######################################
# WORK

brew "cmake"
brew "coreutils"
brew "curl"
brew "dive"
brew "docker"
brew "gd"
# brew "gnu-sed", args: ["--with-default-names"]
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "httpstat"
brew "jpeg"
brew "jq"
brew "libssh2"
brew "mkcert"
brew "openssl"
brew "pcre"
brew "pngquant"
brew "pssh"
brew "readline"
brew "rsync"
brew "terraform"
brew "tig"
brew "gitg"
brew "tmux"
brew "tree"

cask "arduino"
cask "cyberduck"
cask "docker"
cask "iterm2"
cask "mongodb-compass"
cask "ngrok"
cask "p4merge"
cask "postman"
cask "sequel-pro"
cask "sublime-text"
cask "teamviewer"
cask "vagrant"
cask "virtualbox"
